public class variables_in_Java {
    public static void main(String[] args){
        int age;
        age = 121;
        System.out.println(age);

        System.out.println("Давай: " + age + " раз закодим");

        float  num1 = 4.2463864f;
        System.out.println(num1);
    }
}

// byte   - этот тип хранит -128 до 127 число; занимает 1 байт
// short  - этот тип хранит -32768 до 32767 число; занимает 2 байта
// int    - этот тип хранит -2147483648 до 2147483647 число; занимает 4 байта
// long   - этот тип хранит -9223372036854775808 до 9223372036854775807 число; занимает 8 байт

//float   - хранит числа с точкой (нужно добавлять f); занимает 4 байта
//double  - хранит числа с точкой (нужно добавлять d можно и не дописывать); занимает 8 байт
//тип double хранит в два больше цифр после точки чем float